resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Resume</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./style.css">
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org67b4bbd" class="outline-2 personal">
<h2 id="org67b4bbd">Kanishak Vaidya</h2>
<div class="outline-text-2" id="text-org67b4bbd">
<p>
<b>Address:</b> B Block, IISc Bangalore, Bengaluru, Karnataka. 560012<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>E-mail:</b> <a href="mailto:kanishakvaidya@gmail.com">kanishakvaidya@gmail.com</a></td>
<td class="org-left"><b>Website:</b> <a href="https://kanishakvaidya.github.io/phd-progress/">kanishakvaidya.github.io/phd-progress/</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org03bffdf" class="outline-2 sidecol">
<h2 id="org03bffdf">Academic Achievements and Scholarships</h2>
<div class="outline-text-2" id="text-org03bffdf">
<ul class="org-ul">
<li>Granted <b>PMRF</b>: January 2020<br /></li>
<li>GATE (EC) 2018: <b>AIR 10. GATE Score: 1000</b><br /></li>
<li><b>Junior Mathematical Olympiad:</b> 2011. AIR 30<br /></li>
</ul>
</div>
<div id="outline-container-org034e933" class="outline-3">
<h3 id="org034e933">Technical Strengths</h3>
<div class="outline-text-3" id="text-org034e933">
<ul class="org-ul">
<li><b>Programming:</b> Python, Octave/MATLAB, C/C++, Bash scripting<br /></li>
<li><b>Software Tools:</b> LTspice, LabView, Arduino IDE, SimuLink<br /></li>
<li><b>Miscellaneous:</b> Linux, SSH, git, LaTeX, Markdown, HTML/CSS, vim, emacs<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org357d883" class="outline-3">
<h3 id="org357d883">Professional Skills</h3>
<div class="outline-text-3" id="text-org357d883">
<ul class="org-ul">
<li>Research and analysis<br /></li>
<li>Contextual comprehension<br /></li>
<li>Efficient team oversight and coordination<br /></li>
<li>Abstract and critical thinking<br /></li>
<li>Problem solving<br /></li>
<li>Proactive and decisive<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org7c7e4b3" class="outline-3">
<h3 id="org7c7e4b3">Industrial Experience</h3>
<div class="outline-text-3" id="text-org7c7e4b3">
<ul class="org-ul">
<li><b>BSNL Mandi:</b> 45 Day industrial training on <i>telephone exchange</i>, <i>main distribution frames</i> and <i>switching</i>.<br /></li>
<li><b>RWIT:</b> Workshop on wireless technologies, IoT and 5G<br /></li>
<li><b>INMOTC:</b> KV Dhaula Kuan, Delhi. Focus on Complex analysis, Number theory and geometry<br /></li>
</ul>

<button class="printme"><a href="https://kanishakvaidya.github.io/resume/resume.pdf">Download CV</a></button>
</div>
</div>
</div>

<div id="outline-container-orgc267b84" class="outline-2 maincol">
<h2 id="orgc267b84">About me</h2>
<div class="outline-text-2" id="text-orgc267b84">
<p>
As a Ph.D. fellow in ECE department at IISc Bangalore, my research expertise lies in privacy in wireless cache-aided networks, and distributed machine learning systems. I have strong background in signal processing, coding, and information theory and I&rsquo;ve also worked on image processing and computer vision projects.<br />
</p>
</div>
<div id="outline-container-orgab62208" class="outline-3">
<h3 id="orgab62208">Recent Education</h3>
<div class="outline-text-3" id="text-orgab62208">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Qualification</th>
<th scope="col" class="org-left">Institute</th>
<th scope="col" class="org-left">Specialization</th>
<th scope="col" class="org-left">Graduated</th>
<th scope="col" class="org-left">CGPA</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>PhD</b></td>
<td class="org-left">IISc Bangalore</td>
<td class="org-left">Communications</td>
<td class="org-left">Nov 2023</td>
<td class="org-left">8.9/10</td>
</tr>

<tr>
<td class="org-left"><b>M.Tech</b></td>
<td class="org-left">IISc Bangalore</td>
<td class="org-left">Signal Processing</td>
<td class="org-left">Jul 2023</td>
<td class="org-left">8.9/10</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5ee40ad" class="outline-3">
<h3 id="org5ee40ad">Recent Publications</h3>
<div class="outline-text-3" id="text-org5ee40ad">
<ul class="org-ul">
<li>K. Vaidya and B.S. Rajan, <b>&ldquo;Cache-Aided Multi-User Private Information Retrieval using PDAs&rdquo;</b> IEEE TComm, doi:10.1109/TCOMM.2023.3325473.<br /></li>
<li>K. Vaidya and B.S. Rajan, <b>&ldquo;Private Information Delivery with Coded Storage,&rdquo;</b> IEEE ISIT 2022, Espoo, Finland, 24 June – 2 July 2022.<br /></li>
<li>K. Vaidya and B.S. Rajan, <b>&ldquo;Distributed Computation: Privacy, Straggler Mitigation, and Security Against Colluding Workers,&rdquo;</b> IEEE GLOBECOM 2020 doi: 10.1109/GLOBECOM42002.2020.9322092.<br /></li>
<li><b>Other publications</b>: <a href="https://kanishakvaidya.github.io/phd-progress/publications">kanishakvaidya.github.io/phd-progress/publications</a><br />
<ul class="org-ul">
<li>Kanishak Vaidya and B. Sundar Rajan, <b>&ldquo;Cache-Aided Multi-User Private Information Retrieval Using PDAs,&rdquo;</b> 2023 IEEE Information Theory Workshop (ITW), Saint-Malo, France, 23-28 April 2023.<br /></li>
<li>Kanishak Vaidya and B. Sundar Rajan, <b>&ldquo;Cache-Aided Multi-Access Multi-User Private Information Retrieval,&rdquo;</b> 2022 20th International Symposium on Modeling and Optimization in Mobile, Ad hoc, and Wireless Networks (WiOpt), Torino, Italy, 2022, pp. 246-253, doi: 10.23919/WiOpt56218.2022.9930597.<br /></li>
<li>Kanishak Vaidya and B. Sundar Rajan, <b>&ldquo;Multi-User PIR with Cyclic Wraparound Multi-Access Caches&rdquo;</b>. Entropy 2023, 25, 1228. <a href="https://doi.org/10.3390/e25081228">https://doi.org/10.3390/e25081228</a><br /></li>
<li>Kanishak Vaidya and B. Sundar Rajan, <b>&ldquo;Cache-Aided Multi-User Private Information Retrieval using PDAs.&rdquo;</b> arXiv:2212.12979, 26 December 2022.<br /></li>
<li>Kanishak Vaidya and B. Sundar Rajan, <b>&ldquo;Multi-Access Cache-Aided Multi-User Private Information Retrieval,&rdquo;</b> arXiv:2201.11481, 9 Feb 2022.<br /></li>
<li>Kanishak Vaidya and B. Sundar Rajan, <b>&ldquo;Private Information Delivery with Coded Storage,&rdquo;</b> arXiv:2202.03803, 8 Feb 2022.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org03f0c7a" class="outline-3">
<h3 id="org03f0c7a">Projects</h3>
<div class="outline-text-3" id="text-org03f0c7a">
<ul class="org-ul">
<li><b>Communications:</b> OFDM simulation and analysis on Simulink and MATLAB<br /></li>
<li><b>Communications:</b> Created python modules for finite field operations<br /></li>
<li><b>Computer vision</b>: Camera rotation and translation from images on python<br /></li>
<li><b>Hobby projects:</b> Maintain a Linux distribution and package repository<br /></li>
<li><b>Other projects:</b> <a href="https://kanishakvaidya.github.io/phd-progress/projects/index.html">kanishakvaidya.github.io/phd-progress/projects</a><br />
<ul class="org-ul">
<li><b>Arduino based</b> Two-wheel self balancing robot<br /></li>
<li>Image segmentation using watershed transform<br /></li>
<li>Image mosaic using homography estimation<br /></li>
<li><b>Arduino based</b> Plant self care system<br /></li>
<li><b>ATmega2560</b> based Pizza delivery system<br /></li>
<li>Gesture controlled wheelchair<br /></li>
<li>Home security alarm from <b>LDR and BJT Transistors</b><br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9ffdad4" class="outline-3">
<h3 id="org9ffdad4">Key Courses</h3>
<div class="outline-text-3" id="text-org9ffdad4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Digital Communication</b></td>
<td class="org-left">Error Control Coding</td>
<td class="org-left"><b>Matrix Theory</b></td>
</tr>

<tr>
<td class="org-left">Wireless Communication</td>
<td class="org-left"><b>Random Process</b></td>
<td class="org-left">Detection and Estimation</td>
</tr>

<tr>
<td class="org-left"><b>Space-Time Coding</b></td>
<td class="org-left">Information Theory</td>
<td class="org-left"><b>Optimization theory</b></td>
</tr>

<tr>
<td class="org-left">Computer Vision</td>
<td class="org-left"><b>Machine Learning</b></td>
<td class="org-left">Digital Image Processing</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</body>
</html>
